Revit 2024 API
NoiseType Enumeration
 The enumerated type representing the permitted values for the asset property "NoiseType" from the "Noise" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum NoiseType
Visual Basic
Public Enumeration NoiseType
Visual C++
public enum class NoiseType
Members
Member name | Description
Regular
Fractal
Turbulence
See Also
Autodesk.Revit.DB.Visual Namespace